chatting-service/chatting-stress-test.yaml
config:
  target: 'ws://localhost:1012/room-chat'  # WebSocket 서버 URL
  phases:
    - duration: 20  # 테스트 지속 시간 (초)
      arrivalRate: 600  # 초당 1개의 WebSocket 연결 생성 (연결 수 제한)

scenarios:
  - engine: "ws"
    flow:
      - loop:
          - send:
              name: "cian"
              message: "Artillery"
              room: "Test"
              when: "2024-11-29T21:55:14.088113+09:00"
        count: 1